; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v8 - type_1 ?v5 - type_2)
 	      (pred_1 ?v2 - object ?v5 - type_2)
	      (pred_3 ?v8 - type_1 ?v4 - type_3)
	      (pred_2 ?v8 - type_1 ?v2 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v8 - type_1 ?v1 ?v6 - type_2)
       :precondition (and  (pred_4 ?v8 ?v1))
       :effect (and  (pred_4 ?v8 ?v6)
		     (not (pred_4 ?v8 ?v1))))

   (:action op_2
       :parameters (?v8 - type_1 ?v3 - object ?v7 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v7) (pred_4 ?v8 ?v7) (pred_3 ?v8 ?v4))
       :effect (and (pred_2 ?v8 ?v3 ?v4)
		    (not (pred_1 ?v3 ?v7)) 
		    (not (pred_3 ?v8 ?v4))))

   (:action op_1
       :parameters (?v8 - type_1 ?v3 - object ?v7 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v3 ?v4) (pred_4 ?v8 ?v7))
       :effect (and (pred_1 ?v3 ?v7)
		    (pred_3 ?v8 ?v4)
		    (not (pred_2 ?v8 ?v3 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_12 - type_1
obj_04 obj_05 obj_10 obj_03 - type_3
obj_11 obj_08 obj_13 obj_06 - type_2
obj_07 obj_09 obj_02 - object)
(:init
(pred_4 obj_01 obj_08)
(pred_3 obj_01 obj_04)
(pred_3 obj_01 obj_05)
(pred_4 obj_12 obj_06)
(pred_3 obj_12 obj_10)
(pred_3 obj_12 obj_03)
(pred_1 obj_07 obj_13)
(pred_1 obj_09 obj_06)
(pred_1 obj_02 obj_11)
)
(:goal
(and
(pred_1 obj_07 obj_08)
(pred_1 obj_09 obj_06)
(pred_1 obj_02 obj_13)
)
)

(:constraints
  (always (not (pred_4 obj_01 obj_13)))
)
)

; plan
1. (op_3 obj_12 obj_06 obj_11)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_11)
   goals met: 1 of 3
2. (op_2 obj_12 obj_02 obj_11 obj_03)
   deleted: (pred_1 obj_02 obj_11) (pred_3 obj_12 obj_03)
   added: (pred_2 obj_12 obj_02 obj_03)
   goals met: 1 of 3
3. (op_3 obj_12 obj_11 obj_13)
   deleted: (pred_4 obj_12 obj_11)
   added: (pred_4 obj_12 obj_13)
   goals met: 1 of 3
4. (op_1 obj_12 obj_02 obj_13 obj_03)
   deleted: (pred_2 obj_12 obj_02 obj_03)
   added: (pred_1 obj_02 obj_13) (pred_3 obj_12 obj_03)
   goals met: 2 of 3
5. (op_2 obj_12 obj_07 obj_13 obj_03)
   deleted: (pred_1 obj_07 obj_13) (pred_3 obj_12 obj_03)
   added: (pred_2 obj_12 obj_07 obj_03)
   goals met: 2 of 3
6. (op_3 obj_12 obj_13 obj_08)
   deleted: (pred_4 obj_12 obj_13)
   added: (pred_4 obj_12 obj_08)
   goals met: 2 of 3
7. (op_1 obj_12 obj_07 obj_08 obj_03)
   deleted: (pred_2 obj_12 obj_07 obj_03)
   added: (pred_1 obj_07 obj_08) (pred_3 obj_12 obj_03)
   goals met: 3 of 3
